ОперативныеЗадачиФиниш/src/Documents/ОказаниеУслугСервисМенеджером/ОказаниеУслугСервисМенеджером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслугСервисМенеджером</name>
  <registerRecords>InformationRegister.ПланированиеОказанияУслуг</registerRecords>
  <attributes>
    <name>СервисМенеджер</name>
    <type>
      <types>CatalogRef.СервисМенеджеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РеализацияТоваровИУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиФиниш/src/Documents/ОказаниеУслугСервисМенеджером/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Заполнить_НаСервере()

	//Возврат; // Заглушка
	
	Объект.Состав.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланированиеОказаниеУслугСрезПоследних.СервисМенеджер,
		|	ПланированиеОказаниеУслугСрезПоследних.Услуга,
		|	ПланированиеОказаниеУслугСрезПоследних.Контрагент,
		|	ПланированиеОказаниеУслугСрезПоследних.ДокументОснование,
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.ПланируемаяДатаВыполнения) КАК ПланируемаяДатаВыполнения,
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения) КАК РеальнаяДатаВыполнения
		|ИЗ
		|	РегистрСведений.ПланированиеОказаниеУслуг.СрезПоследних(, СервисМенеджер = &СервисМенеджер) КАК ПланированиеОказаниеУслугСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланированиеОказаниеУслугСрезПоследних.ДокументОснование,
		|	ПланированиеОказаниеУслугСрезПоследних.Услуга,
		|	ПланированиеОказаниеУслугСрезПоследних.Контрагент,
		|	ПланированиеОказаниеУслугСрезПоследних.СервисМенеджер
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.ПланируемаяДатаВыполнения) <> ДАТАВРЕМЯ(1, 1, 1) И
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения) = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("СервисМенеджер", Объект.СервисМенеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = Объект.Состав.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить_(Команда)
	Заполнить_НаСервере();
КонецПроцедуры
